<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

stack() 列→行
unstack() 行→列

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = DataFrame(np.arange(6).reshape((2, 3)),
                 index=pd.Index(['Ohio', 'Colorado'], name='state'), # index
                 columns=pd.Index(['one', 'two', 'three'], name='number')) # columns

In [3]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [4]:
result = data.stack() # 列→行，生成一个多层索引的Series，并且列变成内层索引

In [5]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [6]:
result.unstack() # 行→列，将内层索引变成列，生成一个DataFrame

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [7]:
# 传入层级序号或者名称来指定所拆分的层级
result.unstack(0) # 将外层索引变成列，生成一个DataFrame

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [8]:
result.unstack('state') # 将state索引变成列

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [9]:
s1 = Series([0, 1, 2, 3], 
            index=list('abcd'))

In [10]:
s2 = Series([4, 5, 6],
            index=list('cde'))

In [11]:
data2 = pd.concat([s1, s2], # 行方向上连接，
                  keys=['one', 'two']) # 多层索引

In [12]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [13]:
data2.unstack() # 行→列，将内层索引变成列

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [14]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [15]:
data2.unstack().stack(dropna=False) # 保留缺失值

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [16]:
df = DataFrame({'left': result,
                'right': result + 5},
               columns=pd.Index(['left', 'right'], name='side'))

In [17]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [18]:
df.unstack('state') # 行→列，将state索引变成列

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [19]:
df.unstack('state').stack('side') # 行→列，将state索引变成列 ,接着：列→行，将side列变成行索引

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7